{
  "name": "SimpleDrilldownChart",
  "title": "Simple Drilldown Chart",
  "description": "FIXED TWO-LEVEL DRILL-DOWN ONLY: Chart-to-table component with HARDCODED vertical layout. Shows chart at top, data grid at bottom when clicking segments. ONLY USE for simple 'click chart to see matching records in table' scenarios. DO NOT USE for: multi-level drill-downs (chart→chart→table or 3+ levels), nested visualizations, progressive dimension drill-downs (Industry→Region→Accounts), or when user asks for 'sub-charts'. This component CANNOT support custom drill hierarchies - must create custom component for complex multi-level patterns. Example that requires custom component: 'Accounts by Industry, click to see chart by Region, click to see table of accounts' (3 levels).",
  "type": "chart",
  "location": "embedded",
  "functionalRequirements": "WHEN TO USE: Two-level 'click-chart-see-table' pattern only; Single aggregation dimension showing detail records; User wants 'show X by Y, click to see records'; Simple drill-down to tabular details; Requires detail-level entity records (component performs aggregation internally). Example: 'Revenue by Product Category - click to see line items'. WHEN NOT TO USE: Pre-aggregated data from GROUP BY queries (drill-down requires detail records); Multi-level drill-downs with 3+ levels (chart→chart→table or deeper); User requests 'sub-chart' or 'nested chart' or 'drill into another chart'; Progressive multi-dimensional drill-downs like 'by Industry then by Region then table'; Custom visualization at any drill-down level; Any scenario requiring chart-to-chart transitions. CORE FEATURES: Composes SimpleChart + DataGrid + optional SingleRecordView; Click chart segment → shows filtered records in grid below; Split-view vertical layout: chart (top), info bar (middle), grid (bottom); Info bar displays: segment label, aggregated value, record count, percentage of total; Clear selection button returns to chart-only view; Auto-detects grid columns from data or uses gridFields prop to specify columns; Works with or without entityName (entityName enables metadata formatting and OpenEntityRecord/SingleRecordView features); OPEN RECORD FEATURE: To enable clicking drill-down grid rows to open full record forms, MUST provide both entityName AND entityPrimaryKeys props (e.g., entityName='Invoices' entityPrimaryKeys={['ID']}). Without entityPrimaryKeys, rows are viewable but NOT clickable for record opening; Optional 3-column layout with showSingleRecordView=true (requires entityName): chart spans full width at top, grid (60% width) and SingleRecordView (40% width) side-by-side below; Smooth CSS animations for expand/collapse; Blue border highlights chart when segment selected; Inherits all SimpleChart aggregation capabilities (count/sum/average/min/max) and chart types (bar/line/pie/doughnut/area). LAYOUT MODES: 2-column (default, showSingleRecordView=false): vertical stack with chart, info bar, grid with optional OpenEntityRecord on row click (requires entityName + entityPrimaryKeys); 3-column (showSingleRecordView=true, requires entityName): chart at top full width, then grid 60% left and SingleRecordView 40% right. ARCHITECTURAL LIMITATION: This is a FIXED two-level pattern. It cannot be extended to support dynamic levels, chart-to-chart navigation, or custom hierarchies beyond chart→table.",
  "technicalDesign": "CRITICAL ARCHITECTURAL CONSTRAINT: HARDCODED two-level vertical structure (chart → table). Cannot support: chart-to-chart transitions, dynamic level insertion, custom hierarchy depths, multiple chart children, or any drill pattern beyond the fixed layout. Implementation: React functional component using three useState hooks: selectedSegment (stores {label, value, records: Array<object>, percentage}), showGrid (boolean to control grid visibility), selectedRecord (for optional SingleRecordView panel). Three-component composition: (1) SimpleChart at top receives full data prop and optional entityName for client-side aggregation and rendering, handles onDataPointClick event; (2) DataGrid in middle/left receives segment.records filtered array, optional entityName, and optional entityPrimaryKeys, displays in table with sorting/filtering/paging; (3) Optional SingleRecordView in right panel (when showSingleRecordView=true and entityName provided) displays selected grid row details. State flow: Initial state (chart only, showGrid=false) → User clicks chart segment → handleChartClick fires → Set selectedSegment with click data + showGrid=true → Grid renders with segment.records filtered data + info bar appears between chart and grid → Optional: user clicks grid row → handleRowClick fires → Set selectedRecord → SingleRecordView renders in side panel (if enabled). Info bar renders between chart and grid when selectedSegment exists, displays segment.label, segment.value (formatted with toLocaleString), segment.records.length, segment.percentage (if available). Clear selection button in info bar calls handleClearSelection → resets selectedSegment=null, showGrid=false, selectedRecord=null. Grid columns: If gridFields prop provided, uses those field names; Else auto-detects from first record in segment.records, filters out __mj system fields and ID field and object types, limits to first 10 fields. DataGrid integration: Passes data, optional entityName, optional entityPrimaryKeys props to DataGrid; entityName optional allows working with aggregated/joined data without entity metadata; When entityName provided: enables metadata formatting; When showSingleRecordView=false and entityName+entityPrimaryKeys provided, DataGrid handles OpenEntityRecord automatically on row click (no custom onRowClick needed); When showSingleRecordView=true and entityName provided, onRowClick=handleRowClick to populate SingleRecordView panel (entityPrimaryKeys ignored for grid, OpenEntityRecord must be manual from SingleRecordView). Layout styling: Chart wrapped in div with conditional blue 2px border when selectedSegment exists; Info bar has light blue background (#f0f5ff) with 4px left border (#1890ff); Grid wrapped in div with drilldownHeight prop (default 300px), border, overflow:auto; When showSingleRecordView=true, grid and SingleRecordView containers use flex layout (60%/40% split); CSS @keyframes slideDown and slideIn animations for smooth transitions. Data flow: Input data array never mutates, only filtered views (segment.records) passed to DataGrid. Event emission: segmentSelected event fires with {segment} wrapper when segment clicked; selectionCleared fires when clear button clicked; dataPointClick bubbles up from SimpleChart; rowSelected fires with {record, segment} when grid row clicked. Dependency injection: Receives SimpleChart, DataGrid, SingleRecordView from components registry; Shows error message if DataGrid not found; Passes utilities, styles, components, callbacks, savedUserSettings down to all child components. For multi-level drill-downs or custom hierarchies, this component is ARCHITECTURALLY UNSUITABLE - developer must create custom component with multiple SimpleChart instances, custom state management, and navigation logic for chart-to-chart drill flow.",
  "dataRequirements": {
    "mode": "props",
    "description": "Receives DETAIL-LEVEL RECORDS through data prop. Component aggregates records for chart display and filters them for drill-down grid. Do NOT pass pre-aggregated query results."
  },
  "properties": [
    {
      "name": "data",
      "type": "Array<object>",
      "description": "⚠️ DETAIL RECORDS REQUIRED: Array of individual records (NOT pre-aggregated data). This component performs client-side aggregation internally - you provide raw records, it groups them. ANTI-PATTERN: Passing results from aggregate queries (GROUP BY, monthly totals, category sums) - drill-down won't work because there are no detail records to show. CORRECT PATTERN: Pass all raw entity records (invoices, transactions, line items) with a field to group by. Example: For 'Revenue by Month' chart, pass ALL invoice records (not 12 monthly summary rows), add a computed Month field, and let this component aggregate and enable drill-down to individual invoices.",
      "required": true
    },
    {
      "name": "groupBy",
      "type": "string",
      "description": "Field name to group data by",
      "required": true
    },
    {
      "name": "entityName",
      "type": "string",
      "description": "Entity name for metadata lookup. Enables: (1) Smart formatting in chart and grid (dates, money, value lists), (2) Open Record functionality when combined with entityPrimaryKeys, (3) SingleRecordView panel when showSingleRecordView=true. REQUIRED if you want users to open records by clicking drill-down grid rows - must provide both entityName AND entityPrimaryKeys. If omitted, component still works but with basic formatting and no record opening capability.",
      "required": false
    },
    {
      "name": "entityPrimaryKeys",
      "type": "Array<string>",
      "description": "REQUIRED TO ENABLE OPEN RECORD: Array of field names that constitute the primary key(s) for the entity. When provided along with entityName (and showSingleRecordView is false), this ENABLES the 'Open Record' feature - clicking any row in the drill-down grid will open the full entity record form via OpenEntityRecord callback. Without this property, rows are NOT clickable for record opening. Example: ['ID'] for single-key entities, ['OrderID', 'LineNumber'] for composite keys. If showSingleRecordView is true, this property is ignored and SingleRecordView panel displays instead.",
      "required": false,
      "exampleValue": "[\"ID\"]"
    },
    {
      "name": "valueField",
      "type": "string",
      "description": "Field name to aggregate for chart values. REQUIRED when using aggregateMethod 'sum', 'average', 'min', or 'max'. OMIT when using 'count' (counts records regardless of field values). Examples: 'Total' for revenue, 'Amount' for sales, 'Quantity' for inventory. The component will group records by groupBy field and aggregate this valueField according to aggregateMethod.",
      "required": false
    },
    {
      "name": "aggregateMethod",
      "type": "'count' | 'sum' | 'average' | 'min' | 'max'",
      "description": "How to aggregate records within each group. CRITICAL: Choose based on what you're measuring. Use 'count' ONLY when counting records (omit valueField). Use 'sum' for totals (revenue, sales, costs - REQUIRES valueField). Use 'average' for means (average deal size, average rating). Use 'min'/'max' for extremes. COMMON MISTAKE: Using default 'count' when valueField is specified - this counts records instead of summing values! Example: For 'revenue by month', use aggregateMethod='sum' with valueField='Total', NOT count.",
      "required": false,
      "defaultValue": "count"
    },
    {
      "name": "chartType",
      "type": "'auto' | 'bar' | 'line' | 'pie' | 'doughnut' | 'area'",
      "description": "Chart type to render",
      "required": false,
      "defaultValue": "auto"
    },
    {
      "name": "title",
      "type": "string",
      "description": "Chart title",
      "required": false
    },
    {
      "name": "gridFields",
      "type": "Array<string>",
      "description": "Fields to show in drill-down grid",
      "required": false
    },
    {
      "name": "showDrilldown",
      "type": "boolean",
      "description": "Whether to enable drill-down functionality",
      "required": false,
      "defaultValue": true
    },
    {
      "name": "drilldownHeight",
      "type": "number",
      "description": "Height of drill-down panel in pixels",
      "required": false,
      "defaultValue": 300
    },
    {
      "name": "showSingleRecordView",
      "type": "boolean",
      "description": "Whether to show SingleRecordView when a row is selected in the grid",
      "required": false,
      "defaultValue": false
    },
    {
      "name": "singleRecordViewFields",
      "type": "Array<string>",
      "description": "Fields to display in the SingleRecordView",
      "required": false
    }
  ],
  "events": [
    {
      "name": "segmentSelected",
      "description": "Fired when a chart segment is selected",
      "parameters": [
        {
          "name": "segment",
          "type": "{ segment: { label: string; value: number; records: Array<object>; percentage?: number } }",
          "description": "Selected segment info including label, value, and records"
        }
      ]
    },
    {
      "name": "selectionCleared",
      "description": "Fired when selection is cleared",
      "parameters": []
    },
    {
      "name": "dataPointClick",
      "description": "Bubbled event from chart when any data point is clicked",
      "parameters": [
        {
          "name": "clickData",
          "type": "{ seriesName: string; value: number; label: string; records: Array<object>; chartType: string; percentage?: number }",
          "description": "Click data from the chart including label, value, and records"
        }
      ]
    },
    {
      "name": "rowSelected",
      "description": "Fired when a row is selected in the drill-down grid",
      "parameters": [
        {
          "name": "selectionData",
          "type": "{ record: object; segment: { label: string; value: number; records: Array<object> } }",
          "description": "Object containing selected record and current segment context"
        }
      ]
    }
  ],
  "dependencies": [
    {
      "name": "SimpleChart",
      "namespace": "Generic/UI/Chart",
      "location": "registry",
      "description": "Chart component for visualization"
    },
    {
      "name": "DataGrid",
      "namespace": "Generic/UI/Table",
      "location": "registry",
      "description": "Generic data grid for drill-down display"
    },
    {
      "name": "SingleRecordView",
      "namespace": "Generic/UI/Form",
      "location": "registry",
      "description": "Single record display component for selected row details"
    }
  ],
  "code": "@file:../code/simple-drilldown-chart.js",
  "exampleUsage": "<!-- ❌ ANTI-PATTERN: Pre-aggregated data breaks drill-down functionality -->\n<!-- \nconst monthlyTotals = await utilities.rq.RunQuery({\n  QueryName: 'MonthlyRevenueTotals'  // Returns: [{Month: 1, Revenue: 5000}, {Month: 2, Revenue: 6200}, ...]\n});\n\n<SimpleDrilldownChart \n  data={monthlyTotals.Results}  // ❌ WRONG: Only 12 summary rows, no detail records to drill into!\n  groupBy=\"Month\"\n  valueField=\"Revenue\"\n/>\n-->\n\n<!-- ✅ CORRECT PATTERN: Detail records with computed grouping field -->\n<!-- Load ALL detail records and add computed field for grouping -->\nconst invoices = await utilities.rv.RunView({\n  EntityName: 'Invoices',\n  ExtraFilter: 'YEAR(InvoiceDate) = 2025'\n});\n\n// Add computed Month field to each invoice\nconst invoicesWithMonth = invoices.Results.map(inv => ({\n  ...inv,\n  Month: new Date(inv.InvoiceDate).getMonth() + 1,  // 1-12\n  MonthName: new Date(inv.InvoiceDate).toLocaleString('default', { month: 'short' })\n}));\n\n<SimpleDrilldownChart\n  entityName=\"Invoices\"\n  data={invoicesWithMonth}  // ✅ CORRECT: All invoice records, component will aggregate by Month\n  groupBy=\"Month\"  // Component aggregates internally\n  valueField=\"Total\"  // Sum this field\n  aggregateMethod=\"sum\"\n  chartType=\"bar\"\n  title=\"Monthly Revenue - Click to see invoices\"\n  gridFields={['InvoiceNumber', 'InvoiceDate', 'Member', 'Total', 'Status']}\n  entityPrimaryKeys={['ID']}\n  showSingleRecordView={false}\n/>\n\n<!-- Another example: Revenue by Product Category -->\n<SimpleDrilldownChart\n  entityName=\"Invoice Line Items\"\n  data={invoiceItems}  // All line item detail records\n  groupBy=\"ProductCategory\"\n  valueField=\"TotalAmount\"\n  aggregateMethod=\"sum\"\n  chartType=\"bar\"\n  title=\"Revenue by Category - Click to drill down\"\n  gridFields={['ProductName', 'Quantity', 'TotalAmount', 'InvoiceDate']}\n  entityPrimaryKeys={['ID']}\n  showSingleRecordView={false}\n  onDataPointClick={handleChartClick}\n/>\n\n<!-- With SingleRecordView instead of OpenEntityRecord -->\n<SimpleDrilldownChart\n  entityName=\"Invoice Line Items\"\n  data={invoiceItems}  // Detail records, not aggregates\n  groupBy=\"ProductCategory\"\n  valueField=\"TotalAmount\"\n  aggregateMethod=\"sum\"\n  chartType=\"bar\"\n  title=\"Revenue by Category - Click to drill down\"\n  gridFields={['ProductName', 'Quantity', 'TotalAmount', 'InvoiceDate']}\n  showSingleRecordView={true}\n  singleRecordViewFields={['ProductName', 'Description', 'Quantity', 'UnitPrice', 'TotalAmount']}\n  onDataPointClick={handleChartClick}\n  onRowSelected={handleRowSelection}\n/>"
}